/////////////////////Изменение крнфигураций Нетология
//// Изменение представления справочника КонтактныеЛица
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОснований");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//////////////Проверка на заполнение реквизита ДействуетНаОснований
	Если ЗначениеЗаполнено(Данные.ДействуетНаОснований) Тогда
		Представление = СтрШаблон("%1 на оснований от %2" ,Данные.Наименование, Данные.ДействуетНаОснований);
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
/////Конец  Изменение представления справочника КонтактныеЛица
